app/Controllers/Auth.php

SELECT *
FROM `ap_waitlist`
WHERE `id` = '1'
---
    public function submit_waitlist()
    {
        $request = service('request');
        $db = db_connect();

        $id = $request->getPost("waitlist_id");

        if (!$id) {
            return $this->response->setJSON([
                "status" => false,
                "msg" => "Invalid session. Please restart the process."
            ]);
        }

        // Fetch record
        $row = $db->table("waitlist")->where("id", $id)->get()->getRow();

UPDATE `ap_waitlist` SET `full_name` = 'Temi', `phone` = '08098787187', `profession` = 'Mr', `net_worth` = 'Over $500M', `assets` = '[\"Investments\",\"Crypto\",\"Philanthropy\"]', `referral` = 'Referral', `referral_other` = 'pouj', `why` = 'iouytghj', `consent` = 1, `status` = 'complete', `updated_at` = '2025-12-04 10:27:46', `user_agent` = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:145.0) Gecko/20100101 Firefox/145.0', `ip_address` = '127.0.0.1'
WHERE `id` = '1'
---
            "ip_address" => $request->getIPAddress(),
        ];

        $db->table("waitlist")->where("id", $id)->update($data);

SELECT *
FROM `ap_waitlist`
WHERE `email` = 'tophsteve@gmail.com'
---
    public function submit_email_first()
    {
        $request = service('request');
        $db = db_connect();

        $email = trim($request->getPost('email'));

        if (!$email || !filter_var($email, FILTER_VALIDATE_EMAIL)) {
            return $this->response->setJSON([
                "status" => false,
                "type" => "invalid_email",
                "msg" => "Invalid email provided."
            ]);
        }

        // Check if email exists
        $existing = $db->table("waitlist")
            ->where("email", $email)
            ->get()
            ->getRow();